
list_Russian = {1:'АВЕЁИНОРСТ', 2:'ДКЛМПУ', 3:'БГЬЯ', 4:'ЙЫ', 5:'ЖЗХЦЧ', 8:'ФШЭЮ', 10:'Щ', 15:"Ъ"}


def scrabble(word):
    points = 0
    for letter in word:
        for key, value in list_Russian.items():
            if letter.upper() in value:
                points += key
    return points

# Ниже НИЧЕГО НЕ НАДО ИЗМЕНЯТЬ


data = ["курс", 'авеинорстё', 'дклмпеу', 'бгья', 'йы', 'жзхцч', 'фшэю', 'щъ', "карабасбарабас", "околоводопроводного",
        "еженедельное", 'эхоэнцефалограф', 'человеконенавистничество', 'делопроизводительница']

test_data = [6, 10, 13, 12, 8, 25, 32, 25, 21, 26, 20, 54, 34, 36]

for i, d in enumerate(data):
    assert scrabble(d) == test_data[i], f'С набором {d} есть ошибка, не проходит проверку'
    print(f'Тестовый набор {d} прошёл проверку')
print('Всё ок')